run/rhoVoF/rotateSubstrate/reducedCaseCHT/common/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//direct copy from jun
//this file declares the numeric schemes on how a mathmatical operation should be executed
//NOT VERIFIED, should be good for now


ddtSchemes
{
    default          Euler;
}

gradSchemes
{
    default          pointCellsLeastSquares; //Scheufler has here "Gauss linear"
}

divSchemes
{
    default	Gauss linear;

    
    div(phi,U)      Gauss upwind;
    div(rhoPhi,U)      Gauss upwind;
    div(phi,K)      Gauss linear;
    div(phi,h)      Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,R)      Gauss upwind;
    div(R)          Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phiv,p)     Gauss linear;
    div(phi,e)      Gauss upwind;
    div(rhoCpLPhi,T.water) Gauss upwind;
    div(rhoCpVPhi,T.air) Gauss upwind;
}

laplacianSchemes
{
    default          Gauss linear corrected; //Scheufler has here "uncorrected"
}

interpolationSchemes
{
    default          linear;
}

snGradSchemes
{
    default          corrected; // Scheufler has here "uncorrected"
}

fluxRequired
{
    default          no;
    p_rgh;
    pcorr;
    alpha.water;
}


// ************************************************************************* //
